app/controllers/api/v1/schedules_controller.rb

    def index
        @schedules = Schedule.all
---
SELECT "schedules".* FROM "schedules"

    def create
        @schedule = Schedule.new(schedule_params)

        if @schedule.save
---
INSERT INTO "schedules" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Meet up"], ["content", "tomorrow at 9"], ["created_at", "2020-06-12 10:59:11.549827"], ["updated_at", "2020-06-12 10:59:11.549827"]]

    def find_schedule
        @schedule =  Schedule.find_by(id:params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" IS NULL LIMIT ?  [["LIMIT", 1]]