app/controllers/api/v1/users_controller.rb

   def create
        @user = User.find_by(name: params[:name])
        if  !@user
            @user = User.new(user_params)
            if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "vinh"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "david"], ["created_at", "2020-06-12 14:12:18.078933"], ["updated_at", "2020-06-12 14:12:18.078933"]]

    def find_user
        @user =  User.find_by(id:params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]