app/controllers/schedules_controller.rb

    def index
        @schedules = Schedule.all
---
SELECT "schedules".* FROM "schedules"

    def create
        @schedule = Schedule.new(schedule_params)

        if @schedule.save
---
INSERT INTO "schedules" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["content", ""], ["created_at", "2020-06-11 10:31:21.812688"], ["updated_at", "2020-06-11 10:31:21.812688"]]

    def update

        if @schedule.update(schedule_params)
---
UPDATE "schedules" SET "content" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["content", "dadasd fun thing"], ["updated_at", "2020-06-12 09:13:12.951421"], ["id", 5]]

    def destroy
        @schedule.destroy
---
DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 7]]

    def find_schedule
        @schedule =  Schedule.find_by(id:params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]